# <font color='darkblue' size=4> Introdução a panda </font>

In [14]:
import pandas as pd
#abrir um arquivo CSV
df = pd.read_csv("salarios.csv", encoding = "UTF-8", sep=',')
df.shape

(31101, 8)

In [2]:
df.head()

,Name,Job Titles,Department,Full or Part-Time,Salary or Hourly,Typical Hours,Annual Salary,Hourly Rate
0,"AARON, JEFFERY M",SERGEANT,POLICE,F,Salary,NaN,122568.0,NaN
1,"AARON, KARINA",POLICE OFFICER (ASSIGNED AS DETECTIVE),POLICE,F,Salary,NaN,110796.0,NaN
2,"ABAD JR, VICENTE M",CIVIL ENGINEER IV,WATER MGMNT,F,Salary,NaN,122112.0,NaN
3,"ABARCA, EMMANUEL",CONCRETE LABORER,TRANSPORTN,F,Hourly,40.0,NaN,45.9
4,"ABARCA, FRANCES J",POLICE OFFICER,POLICE,F,Salary,NaN,86730.0,NaN

In [3]:
df = pd.read_csv("salarios.csv", header = 2 )
df.head()

,"AARON, KARINA",POLICE OFFICER (ASSIGNED AS DETECTIVE),POLICE,F,Salary,Unnamed: 5,110796.00,Unnamed: 7
0,"ABAD JR, VICENTE M",CIVIL ENGINEER IV,WATER MGMNT,F,Salary,NaN,122112.0,NaN
1,"ABARCA, EMMANUEL",CONCRETE LABORER,TRANSPORTN,F,Hourly,40.0,NaN,45.9
2,"ABARCA, FRANCES J",POLICE OFFICER,POLICE,F,Salary,NaN,86730.0,NaN
3,"ABBATACOLA, ROBERT J",ELECTRICAL MECHANIC,AVIATION,F,Hourly,40.0,NaN,51.0
4,"ABBATEMARCO, JAMES J",FIRE ENGINEER-EMT,FIRE,F,Salary,NaN,118830.0,NaN

In [4]:
df = pd.read_csv("salarios.csv", usecols = ['Name', 'Job Titles', 'Department'])
print(df)

                      Name                              Job Titles  \
0        AARON,  JEFFERY M                                SERGEANT
1           AARON,  KARINA  POLICE OFFICER (ASSIGNED AS DETECTIVE)
2      ABAD JR,  VICENTE M                       CIVIL ENGINEER IV
3        ABARCA,  EMMANUEL                        CONCRETE LABORER
4       ABARCA,  FRANCES J                          POLICE OFFICER
...                    ...                                     ...
31096   ZYLINSKA,  KLAUDIA                          POLICE OFFICER
31097   ZYMANTAS,  LAURA C                          POLICE OFFICER
31098    ZYMANTAS,  MARK E                          POLICE OFFICER
31099  ZYRKOWSKI,  CARLO E                          POLICE OFFICER
31100  ZYSKOWSKI,  DARIUSZ                 CHIEF DATA BASE ANALYST

        Department
0           POLICE
1           POLICE
2      WATER MGMNT
3       TRANSPORTN
4           POLICE
...            ...
31096       POLICE
31097       POLICE
31098       POLICE
31099       POLICE
31100         DAIS

[31101 rows x 3 columns]

In [15]:
df = pd.read_csv("salarios.csv", usecols = ['Name', 'Job Titles'], nrows = 10)
print(df)

                    Name                              Job Titles
0      AARON,  JEFFERY M                                SERGEANT
1         AARON,  KARINA  POLICE OFFICER (ASSIGNED AS DETECTIVE)
2    ABAD JR,  VICENTE M                       CIVIL ENGINEER IV
3      ABARCA,  EMMANUEL                        CONCRETE LABORER
4     ABARCA,  FRANCES J                          POLICE OFFICER
5  ABBATACOLA,  ROBERT J                     ELECTRICAL MECHANIC
6  ABBATEMARCO,  JAMES J                       FIRE ENGINEER-EMT
7       ABBATE,  TERRY M                          POLICE OFFICER
8       ABBOTT,  BETTY L                      FOSTER GRANDPARENT
9      ABBOTT,  CARMELLA                          POLICE OFFICER

In [16]:
df.shape

(10, 2)